// // Ввести N от 0 до 10 с проверкой ввода.

// int n;
// do
// {
//     n=Convert.ToInt32(System.Console.ReadLine());
// }
// while(n<0 || n>10);

// Цикл ДЛЯ
// Вывести на экран числа от 1 до 10.


for(int i=1;i<=10;i++)
{
    System.Console.WriteLine(i);
}
