// 88. Заменить все вхождения подстроки w в строке st на строку v. 
// Вывести на экран первоначальную строку и конечную строку.

string st="58712786126867";
string w="12";
string v="000";
System.Console.WriteLine(st);
System.Console.WriteLine(st.Replace(w,v));
